# astype()
convert float value to int value

In [1]:
import pandas as pd

In [6]:
nba=pd.read_csv("nba.csv").head(5)

In [7]:
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [8]:
nba=pd.read_csv("nba.csv")

In [9]:
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [20]:
nba["College"].fillna("None",inplace = True)

In [18]:
nba.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [14]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      458 non-null float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [21]:
Temp ="35.7+KB"

In [23]:
nba["Salary"]= nba["Salary"].astype("int" ,inplace = True )

In [25]:
nba.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,None,5000000

In [33]:
nba["Salary"].astype("float" , inplace=True).head(5)

0    7730337.0
1    6796117.0
2          0.0
3    1148640.0
4    5000000.0
Name: Salary, dtype: float64

In [34]:
nba["Salary"].astype("int" , inplace=True).head(5)

0    7730337
1    6796117
2          0
3    1148640
4    5000000
Name: Salary, dtype: int64

In [39]:
nba["Position"]

0       PG
1       SF
2       SG
3       SG
4       PF
5       PF
6       PF
7        C
8       PG
9       PG
10       C
11      PG
12      SG
13      SG
14       C
15      SG
16      SG
17      SG
18      SG
19      PG
20      SG
21      SG
22      PG
23       C
24      PF
25      PF
26      PF
27       C
28      PG
29      PF
      ...
428     SF
429     SG
430     SG
431      C
432     SF
433     SG
434      C
435     PF
436     PG
437     SG
438     SG
439      C
440     PG
441     PF
442     PF
443     PG
444     SG
445     PG
446     PF
447      C
448     SF
449     SG
450     SF
451     SF
452     PF
453     PG
454     PG
455      C
456      C
457    NaN
Name: Position, Length: 458, dtype: object

In [41]:
nba["Position"].nunique()

5

In [44]:
nba["Position"].astype("category")

0       PG
1       SF
2       SG
3       SG
4       PF
5       PF
6       PF
7        C
8       PG
9       PG
10       C
11      PG
12      SG
13      SG
14       C
15      SG
16      SG
17      SG
18      SG
19      PG
20      SG
21      SG
22      PG
23       C
24      PF
25      PF
26      PF
27       C
28      PG
29      PF
      ...
428     SF
429     SG
430     SG
431      C
432     SF
433     SG
434      C
435     PF
436     PG
437     SG
438     SG
439      C
440     PG
441     PF
442     PF
443     PG
444     SG
445     PG
446     PF
447      C
448     SF
449     SG
450     SF
451     SF
452     PF
453     PG
454     PG
455      C
456      C
457    NaN
Name: Position, Length: 458, dtype: category
Categories (5, object): [C, PF, PG, SF, SG]

In [46]:
nba["Position"] = nba["Position"].astype("category")

In [48]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null category
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     458 non-null object
Salary      458 non-null int64
dtypes: category(1), float64(3), int64(1), object(4)
memory usage: 29.3+ KB

In [49]:
nba["Team"] = nba["Team"].astype("category")

In [50]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null category
Number      457 non-null float64
Position    457 non-null category
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     458 non-null object
Salary      458 non-null int64
dtypes: category(2), float64(3), int64(1), object(3)
memory usage: 27.7+ KB